In [1]:
import pandas as pd

# import data
df = pd.read_csv('raw_data.csv')

In [2]:
# Transforming Data

# sort_values() : # Sort rows based on Salary column (ascending by default)
sorted_data = df.sort_values("income", ascending=False)
sorted_data

# sorted_data.sort_index()

# reset_index() : creates a new sequential index
sorted_data.reset_index()

# reset_index(drop=True) : removes old index completely
sorted_data.reset_index(drop=True)

    id          name   age country   gender   income
0    6           NaN  45.0   India   Female  73000.0
1    7    Ahmed Khan  38.0     NaN     Male  68000.0
2    8    Rachel Lee  29.0     USA   Female  62000.0
3    2    Jane Smith   NaN  Canada   Female  62000.0
4   10   Emily Davis  31.0     USA      NaN  58000.0
5    1      John Doe  29.0     USA     Male  55000.0
6    1      John Doe  29.0     USA     Male  55000.0
7    5        Li Wei  27.0   China     Male  51000.0
8    3          Alex   NaN     USA  Unknown  47000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10   4  Maria Garcia  34.0   Spain   Female      NaN

In [3]:
# Transforming Data : Ranking

# rank() : Assign rank based on Salary (lowest salary - rank 1)
sorted_data["Ranking"] = sorted_data["income"].rank()

# ascending=False, highest salary - rank 1
# dense ranking (no gaps in ranks)
sorted_data["Ranking"] = sorted_data["income"].rank(ascending=False, method="dense")
sorted_data

    id          name   age country   gender   income  Ranking
6    6           NaN  45.0   India   Female  73000.0      1.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0      2.0
8    8    Rachel Lee  29.0     USA   Female  62000.0      3.0
2    2    Jane Smith   NaN  Canada   Female  62000.0      3.0
10  10   Emily Davis  31.0     USA      NaN  58000.0      4.0
0    1      John Doe  29.0     USA     Male  55000.0      5.0
1    1      John Doe  29.0     USA     Male  55000.0      5.0
5    5        Li Wei  27.0   China     Male  51000.0      6.0
3    3          Alex   NaN     USA  Unknown  47000.0      7.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      8.0
4    4  Maria Garcia  34.0   Spain   Female      NaN      NaN

In [4]:
# Transforming Data

new_data = df.copy()

# Changing column names

# new_data.columns = ["Id",	"Name",	"Age", "Country", "Gender", "Salary"]
new_data.columns = new_data.columns.str.capitalize()

# rename() :
# `rename(columns={...})` allows changing selected column names
new_data = new_data.rename(columns={"Income": "Salary"})

# rename() :
# `rename(index={...})` allows changing selected row labels
new_data = new_data.rename(index={1: "First"})

new_data

       Id          Name   Age Country   Gender   Salary
0       1      John Doe  29.0     USA     Male  55000.0
First   1      John Doe  29.0     USA     Male  55000.0
2       2    Jane Smith   NaN  Canada   Female  62000.0
3       3          Alex   NaN     USA  Unknown  47000.0
4       4  Maria Garcia  34.0   Spain   Female      NaN
5       5        Li Wei  27.0   China     Male  51000.0
6       6           NaN  45.0   India   Female  73000.0
7       7    Ahmed Khan  38.0     NaN     Male  68000.0
8       8    Rachel Lee  29.0     USA   Female  62000.0
9       9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10     10   Emily Davis  31.0     USA      NaN  58000.0